# 인공지능
## 1. Python_Data_Analytics_and_Visualization

### C. Data Preprocessing

#### III. 데이터프레임 합치기
##### 1) 데이터 프레임 TB1, TB2, TB3, TB4

In [1]:
import pandas as pd

TB1 = pd.DataFrame({'Name' : ['송태섭', '최유정', '이한나', '김소혜'],
                    'Gender': ['남자', '여자', '여자', '여자'],
                    'Age' : ['21', '23', '20', '23']})
            
TB1

  Name Gender Age
0  송태섭     남자  21
1  최유정     여자  23
2  이한나     여자  20
3  김소혜     여자  23

In [2]:
TB2 = pd.DataFrame({'Name': ['송태섭', '최유정', '이한나', '김소혜'],
                    'Gender': ['남자', '여자', '여자', '여자'],
                    'Height': [179.1, 177.1, 167.9, 176.1],
                    'Weight': [63.9, 54.9, 50.2, 53.5]})

TB2

  Name Gender  Height  Weight
0  송태섭     남자   179.1    63.9
1  최유정     여자   177.1    54.9
2  이한나     여자   167.9    50.2
3  김소혜     여자   176.1    53.5

In [3]:
TB3 = pd.DataFrame({'Name': ['서태웅', '정대만'],
                    'Gender': ['남자', '남자'],
                    'Age': ['24', '24']})


TB3

  Name Gender Age
0  서태웅     남자  24
1  정대만     남자  24

In [4]:
TB4 = pd.DataFrame({'Grade': [3, 1, 1, 3],
                    'Picture': ['무', '유', '무', '무']})


TB4

   Grade Picture
0      3       무
1      1       유
2      1       무
3      3       무

##### 2) concat()
* 행기준 axis = 0

In [5]:
pd.concat([TB1, TB2], axis=0)

  Name Gender  Age  Height  Weight
0  송태섭     남자   21     NaN     NaN
1  최유정     여자   23     NaN     NaN
2  이한나     여자   20     NaN     NaN
3  김소혜     여자   23     NaN     NaN
0  송태섭     남자  NaN   179.1    63.9
1  최유정     여자  NaN   177.1    54.9
2  이한나     여자  NaN   167.9    50.2
3  김소혜     여자  NaN   176.1    53.5

In [6]:
pd.concat([TB1, TB2], axis=1)

  Name Gender Age Name Gender  Height  Weight
0  송태섭     남자  21  송태섭     남자   179.1    63.9
1  최유정     여자  23  최유정     여자   177.1    54.9
2  이한나     여자  20  이한나     여자   167.9    50.2
3  김소혜     여자  23  김소혜     여자   176.1    53.5

In [7]:
pd.concat([TB1, TB4], axis=1)

  Name Gender Age  Grade Picture
0  송태섭     남자  21      3       무
1  최유정     여자  23      1       유
2  이한나     여자  20      1       무
3  김소혜     여자  23      3       무

In [8]:
pd.concat([TB1, TB3], axis=0, ignore_index=True)

  Name Gender Age
0  송태섭     남자  21
1  최유정     여자  23
2  이한나     여자  20
3  김소혜     여자  23
4  서태웅     남자  24
5  정대만     남자  24

##### 3) merge()